QuantumLeaps/qpc/3rd_party/STM32CubeL5/Drivers/BSP/Components/lsm6dso/lsm6dso_reg.h
typedef struct {
    lsm6dso_int1_ctrl_t          int1_ctrl;
    lsm6dso_md1_cfg_t            md1_cfg;
    lsm6dso_emb_func_int1_t      emb_func_int1;
    lsm6dso_fsm_int1_a_t         fsm_int1_a;
    lsm6dso_fsm_int1_b_t         fsm_int1_b;
} lsm6dso_pin_int1_route_t;
int32_t lsm6dso_pin_int1_route_set(stmdev_ctx_t *ctx,
                                   lsm6dso_pin_int1_route_t *val);
int32_t lsm6dso_pin_int1_route_get(stmdev_ctx_t *ctx,
                                   lsm6dso_pin_int1_route_t *val);

typedef struct {
  lsm6dso_int2_ctrl_t          int2_ctrl;
  lsm6dso_md2_cfg_t            md2_cfg;
  lsm6dso_emb_func_int2_t      emb_func_int2;
  lsm6dso_fsm_int2_a_t         fsm_int2_a;
  lsm6dso_fsm_int2_b_t         fsm_int2_b;
} lsm6dso_pin_int2_route_t;
int32_t lsm6dso_pin_int2_route_set(stmdev_ctx_t *ctx,
                                   lsm6dso_pin_int2_route_t *val);
int32_t lsm6dso_pin_int2_route_get(stmdev_ctx_t *ctx,
                                   lsm6dso_pin_int2_route_t *val);

typedef enum {
  LSM6DSO_PUSH_PULL   = 0,
  LSM6DSO_OPEN_DRAIN  = 1,
} lsm6dso_pp_od_t;
int32_t lsm6dso_pin_mode_set(stmdev_ctx_t *ctx, lsm6dso_pp_od_t val);
int32_t lsm6dso_pin_mode_get(stmdev_ctx_t *ctx, lsm6dso_pp_od_t *val);

typedef enum {
  LSM6DSO_ACTIVE_HIGH = 0,
  LSM6DSO_ACTIVE_LOW  = 1,
} lsm6dso_h_lactive_t;
int32_t lsm6dso_pin_polarity_set(stmdev_ctx_t *ctx,
                                 lsm6dso_h_lactive_t val);
int32_t lsm6dso_pin_polarity_get(stmdev_ctx_t *ctx,
                                 lsm6dso_h_lactive_t *val);

int32_t lsm6dso_all_on_int1_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_all_on_int1_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSO_ALL_INT_PULSED            = 0,
  LSM6DSO_BASE_LATCHED_EMB_PULSED   = 1,
  LSM6DSO_BASE_PULSED_EMB_LATCHED   = 2,
  LSM6DSO_ALL_INT_LATCHED           = 3,
} lsm6dso_lir_t;
int32_t lsm6dso_int_notification_set(stmdev_ctx_t *ctx, lsm6dso_lir_t val);
int32_t lsm6dso_int_notification_get(stmdev_ctx_t *ctx, lsm6dso_lir_t *val);

typedef enum {
  LSM6DSO_LSb_FS_DIV_64       = 0,
  LSM6DSO_LSb_FS_DIV_256      = 1,
} lsm6dso_wake_ths_w_t;
int32_t lsm6dso_wkup_ths_weight_set(stmdev_ctx_t *ctx,
                                      lsm6dso_wake_ths_w_t val);
int32_t lsm6dso_wkup_ths_weight_get(stmdev_ctx_t *ctx,
                                       lsm6dso_wake_ths_w_t *val);

int32_t lsm6dso_wkup_threshold_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_wkup_threshold_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso_xl_usr_offset_on_wkup_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_xl_usr_offset_on_wkup_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso_wkup_dur_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_wkup_dur_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso_gy_sleep_mode_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_gy_sleep_mode_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSO_DRIVE_SLEEP_CHG_EVENT = 0,
  LSM6DSO_DRIVE_SLEEP_STATUS    = 1,
} lsm6dso_sleep_status_on_int_t;
int32_t lsm6dso_act_pin_notification_set(stmdev_ctx_t *ctx,
                                         lsm6dso_sleep_status_on_int_t val);
int32_t lsm6dso_act_pin_notification_get(stmdev_ctx_t *ctx,
                                         lsm6dso_sleep_status_on_int_t *val);

typedef enum {
  LSM6DSO_XL_AND_GY_NOT_AFFECTED      = 0,
  LSM6DSO_XL_12Hz5_GY_NOT_AFFECTED    = 1,
  LSM6DSO_XL_12Hz5_GY_SLEEP           = 2,
  LSM6DSO_XL_12Hz5_GY_PD              = 3,
} lsm6dso_inact_en_t;
int32_t lsm6dso_act_mode_set(stmdev_ctx_t *ctx, lsm6dso_inact_en_t val);
int32_t lsm6dso_act_mode_get(stmdev_ctx_t *ctx, lsm6dso_inact_en_t *val);

int32_t lsm6dso_act_sleep_dur_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_act_sleep_dur_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso_tap_detection_on_z_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_tap_detection_on_z_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso_tap_detection_on_y_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_tap_detection_on_y_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso_tap_detection_on_x_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_tap_detection_on_x_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso_tap_threshold_x_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_tap_threshold_x_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSO_XYZ = 0,
  LSM6DSO_YXZ = 1,
  LSM6DSO_XZY = 2,
  LSM6DSO_ZYX = 3,
  LSM6DSO_YZX = 5,
  LSM6DSO_ZXY = 6,
} lsm6dso_tap_priority_t;
int32_t lsm6dso_tap_axis_priority_set(stmdev_ctx_t *ctx,
                                      lsm6dso_tap_priority_t val);
int32_t lsm6dso_tap_axis_priority_get(stmdev_ctx_t *ctx,
                                      lsm6dso_tap_priority_t *val);

int32_t lsm6dso_tap_threshold_y_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_tap_threshold_y_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso_tap_threshold_z_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_tap_threshold_z_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso_tap_shock_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_tap_shock_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso_tap_quiet_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_tap_quiet_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso_tap_dur_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_tap_dur_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSO_ONLY_SINGLE = 0,
  LSM6DSO_BOTH_SINGLE_DOUBLE = 1,
} lsm6dso_single_double_tap_t;
int32_t lsm6dso_tap_mode_set(stmdev_ctx_t *ctx,
                             lsm6dso_single_double_tap_t val);
int32_t lsm6dso_tap_mode_get(stmdev_ctx_t *ctx,
                             lsm6dso_single_double_tap_t *val);

typedef enum {
  LSM6DSO_DEG_80  = 0,
  LSM6DSO_DEG_70  = 1,
  LSM6DSO_DEG_60  = 2,
  LSM6DSO_DEG_50  = 3,
} lsm6dso_sixd_ths_t;
int32_t lsm6dso_6d_threshold_set(stmdev_ctx_t *ctx, lsm6dso_sixd_ths_t val);
int32_t lsm6dso_6d_threshold_get(stmdev_ctx_t *ctx, lsm6dso_sixd_ths_t *val);

int32_t lsm6dso_4d_mode_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_4d_mode_get(stmdev_ctx_t *ctx, uint8_t *val);

